app/controllers/comments_controller.rb

	def create
		@comment = @event.comments.build(comment_params)
		@comment.user = current_user
		if @comment.save
---
INSERT INTO "comments" ("contents", "created_at", "event_id", "updated_at") VALUES (?, ?, ?, ?)  [["contents", "I am going to shoot myself for not fixing this"], ["created_at", Fri, 07 Feb 2014 10:04:06 UTC +00:00], ["event_id", 1], ["updated_at", Fri, 07 Feb 2014 10:04:06 UTC +00:00]]

	def update
		if @comment.update_attributes(comment_params)
---
UPDATE "comments" SET "contents" = ?, "updated_at" = ? WHERE "comments"."id" = 1  [["contents", "I changed this comment oh yea: going to shoot myself for not fixing this"], ["updated_at", Fri, 07 Feb 2014 10:21:15 UTC +00:00]]

	def set_comment
		@comment = @event.comments.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ? AND "comments"."id" = ? LIMIT 1  [["event_id", 1], ["id", "3"]]