app/controllers/events_controller.rb

  def update
  	respond_to do |format|
  		if @event.update(event_params)
---
UPDATE "events" SET "name" = ?, "priority" = ?, "updated_at" = ? WHERE "events"."id" = 4  [["name", "Need a name"], ["priority", 1], ["updated_at", Sun, 26 Jan 2014 09:30:43 UTC +00:00]]

  def create
  	@event = Event.new(event_params)
  	if @event.save
---
INSERT INTO "events" ("created_at", "due_date", "due_time", "name", "notes", "priority", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"